---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotOverlapBoundingElement
source: html/ed593c79-893f-b7bf-c09d-2e598708793f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotOverlapBoundingElement Property

An error occurred while trying to find the region where a face of the bounding geometry for [Room] overlaps a face of a room-bounding element [Name].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomGeometryCannotOverlapBoundingElement { get; }
```